---
title: Reference
classe: Autodesk.Revit.DB.SpecTypeId+Reference
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# Reference

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ForgeTypeId FillPattern { get; }` | `Reference.FillPattern` | ForgeTypeId |
| `ForgeTypeId Image { get; }` | `Reference.Image` | ForgeTypeId |
| `ForgeTypeId LoadClassification { get; }` | `Reference.LoadClassification` | ForgeTypeId |
| `ForgeTypeId Material { get; }` | `Reference.Material` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```